package studey_abstract;
/*
抽象类
1.什么是抽象类，类和类之间有的共同特征，讲这些特征提取出来，形成的就是抽象类
类本事是不存在的，所以抽象类不能创建对象
2.抽象类属于引用数据类型
3.抽象类语法：
【修饰符列表】 abstract class 类名{

}
4.抽象类是无法实例化的，无法创建对象的，所以抽象类是用来被子类继承的
5.final和abstract不能联合使用，这两个关键字是对立的
6.抽象类的子类还可以是子类
7.抽象类虽然无法实例化，但是抽象类有构造方法，这个构造方法是供子类使用的
8.抽象关联到一个概念：抽象方法，是没有实现的方法，没有方法体的方法
eg:public abstract void dosome();
特点：没有方法体，以分号结尾，前面的修饰符列表中有abstract关键字
9.抽象类中不一定有抽象方法，也不一定有非抽象方法，但是抽象方法必须出现在抽象类中
10.一个非抽象的类，必须要把抽象类中的抽象方法实现了，这是java语法上强行规定的，不然编译器就给报错

 */
public class Abstract_study {
}
